tests/testdata/customer_orders/pos/01_menu_items_only.json

{
    "version": "0.1",
    "test_p": 0,
    "external_order_reference_nr": null,
    "order_placement_channel_id": 3,
    "order_notes": "I want food ASAP!!",
    "payment_point_id": null,
    "payment_details": {
        "payable_amount": 25,
        "tip_amount": 0,
        "discount_amount": 0,
        "tax_amount": 1.19,
        "currency_name": "aed",
        "payment_method_name": "card",
        "paid_p": 0,
        "split_payment_details": [
            {
                "payment_method_id": 1,
                "currency_id": 1,
                "payment_status": "paid",
                "payment_amount": 12,
                "payment_timestamp": "2023-01-01 00:00:00"
            },
            {
                "payment_method_id": 2,
                "currency_id": 1,
                "payment_status": "paid",
                "payment_amount": 13,
                "payment_timestamp": "2023-01-01 00:00:00"
            }
        ]
    },
    "employee_details": {
        "external_employee_id": "1ee11",
        "first_name_en": null,
        "last_name_en": null,
        "email": "merchant_employee@gmail.com",
        "phone_nr": null
    },
    "integration_details": {
        "branch_id": 7,
        "brand_id": 2,
        "facility_id": 3,
        "marketplace_id": 1,
        "fulfillment_type": "dine-in"
    },
    "customer_details": {
        "external_customer_id": null,
        "first_name_en": null,
        "last_name_en": null,
        "email": null,
        "phone_nr": null,
        "customer_contact_method": "link"
    },
    "item_list": [
        {
            "external_item_id": "pb_048351",
            "display_name_en": "Potato Bun",
            "display_name_ar": "",
            "price": 6,
            "quantity": 1,
            "modifier_section_list": []
        },
        {
            "external_item_id": "cc_145095",
            "display_name_en": "Coca Cola",
            "display_name_ar": "",
            "price": 8,
            "quantity": 1,
            "modifier_section_list": []
        },
        {
            "external_item_id": "c_203315",
            "display_name_en": "Coleslaw",
            "display_name_ar": "",
            "price": 11,
            "quantity": 1,
            "modifier_section_list": []
        }
    ],
    "offer_list": []
}
